ka2_2024/src/AccumulationRegisters/ПрочиеРасходы/ПрочиеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДД</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПрочихАктивов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоляСтоимости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектУчетаРезервов</name>
    <type>
      <types>CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидРезервов</name>
    <type>
      <types>CatalogRef.Резервы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсточника</name>
    <type>
      <types>EnumRef.ВидыИсточниковДвижений</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчета</name>
    <type>
      <types>DocumentRef.РегистраторРасчетаСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗакрытияМесяца</name>
    <type>
      <types>EnumRef.РежимыЗакрытияМесяца</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ka2_2024/src/InformationRegisters/АрендованныеОС/АрендованныеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АрендованныеОС</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </resources>
  <resources>
    <name>НоминальнаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/Enums/ВидыСчетовРеглУчета/ВидыСчетовРеглУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСчетовРеглУчета</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>АрендныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродаж</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаРаздельныйНУ</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
  </enumValues>
  <enumValues>
    <name>ЗабалансовыйУчетВНА</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыНаПриобретениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработку</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработкуВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НачислениеПроцентовПоАренде</name>
  </enumValues>
  <enumValues>
    <name>НДСпоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>НДСПриАренде</name>
  </enumValues>
  <enumValues>
    <name>НДСПриДоходах</name>
  </enumValues>
  <enumValues>
    <name>НДСПриЗакупке</name>
  </enumValues>
  <enumValues>
    <name>НДСПриОтгрузкеБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродаже</name>
  </enumValues>
  <enumValues>
    <name>НеотфактурованныеПоставки</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданная</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ОбесценениеВНА</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгосрочнойЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>ПродажиПоЭквайрингу</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоДисконтированию</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоДисконтированиюРезервов</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперации</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоБронированию</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПодарочнымСертификатам</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРасчетыПоПретензиям</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиТара</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиТара</name>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>РезервДоОценкиВНА</name>
  </enumValues>
  <enumValues>
    <name>Резервы</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеПереданные</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеПроизводства</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовЕНВД</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовОСНО</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатацииЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>ТМЦКСписанию</name>
  </enumValues>
  <enumValues>
    <name>ТМЦНаСкладах</name>
  </enumValues>
  <enumValues>
    <name>ТМЦУХранителей</name>
  </enumValues>
  <enumValues>
    <name>ТоварыКомитентовКОформлениюПоЗакупке</name>
  </enumValues>
  <enumValues>
    <name>ТоварыКомитентовКОформлениюПоПродаже</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>ТоварыПереданныеНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>УслугаПоАренде</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработкуУХранителей</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПринятыеВПереработкуКСписанию</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>НДСАвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>НДСАвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>МатериалыПотребленныеВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ТМЦПотребленныеВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>АрендныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>НГЛС</name>
    <comment>Негарантированная ликвидационная стоимость</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентныйДисконт</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыбытиеВНА</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПринятоКЗабалансовомуУчету</name>
  </enumValues>
  <enumValues>
    <name>ПереданоВАренду</name>
  </enumValues>
  <enumValues>
    <name>ЗаключенДоговорАренды</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/CommonModules/ПрекращениеДоговораАрендыЛокализация/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры, используемые для локализации документа "Прекращение договора аренды".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
// 
// Параметры:
//  Объект - ДокументОбъект.ПрекращениеДоговораАренды - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения - Строка - 
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	//++ Локализация
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ИнвентаризацияОС") Тогда
		ЗаполнитьНаОснованииИнвентаризацииОСПриВводеНаОсновании(Объект, ДанныеЗаполнения);
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область Механизмы

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация
	МеханизмыДокумента.Добавить("ИмущественныеНалоги");
	МеханизмыДокумента.Добавить("РегламентированныйУчет");
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область Проведение

Функция ТекстЗапросаТаблицаПервоначальныеСведенияОС() Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ПервоначальныеСведенияОС.ОсновноеСредство КАК ОсновноеСредство,
	|
	|	ПервоначальныеСведенияОС.СпособПоступления КАК СпособПоступления,
	|	ПервоначальныеСведенияОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	ПервоначальныеСведенияОС.ПорядокУчетаНУ КАК ПорядокУчетаНУ,
	|	ПервоначальныеСведенияОС.ПорядокУчетаУУ КАК ПорядокУчетаУУ,
	|	ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|	ПервоначальныеСведенияОС.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ,
	|	ПервоначальныеСведенияОС.СтоимостьДо2002 КАК СтоимостьДо2002,
	|	ПервоначальныеСведенияОС.АмортизацияДо2002 КАК АмортизацияДо2002,
	|	ПервоначальныеСведенияОС.АмортизацияДо2009 КАК АмортизацияДо2009,
	|	ПервоначальныеСведенияОС.ФактическийСрокИспользованияДо2009 КАК ФактическийСрокИспользованияДо2009,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимостьБУ КАК ПервоначальнаяСтоимостьБУ,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимостьНУ,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимостьУУ КАК ПервоначальнаяСтоимостьУУ,
	|	ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ КАК ДатаВводаВЭксплуатациюБУ,
	|	ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюНУ КАК ДатаВводаВЭксплуатациюНУ,
	|	ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюУУ КАК ДатаВводаВЭксплуатациюУУ,
	|	ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюБУ КАК ДокументВводаВЭксплуатациюБУ,
	|	ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюНУ КАК ДокументВводаВЭксплуатациюНУ,
	|	ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюУУ КАК ДокументВводаВЭксплуатациюУУ,
	|
	|	ВЫБОР
	|		КОГДА ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА &Ссылка 
	|		ИНАЧЕ ПервоначальныеСведенияОС.ДокументСнятияСУчетаБУ
	|	КОНЕЦ КАК ДокументСнятияСУчетаБУ,
	|
	|	ВЫБОР
	|		КОГДА ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюНУ <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА &Ссылка 
	|		ИНАЧЕ ПервоначальныеСведенияОС.ДокументСнятияСУчетаНУ
	|	КОНЕЦ КАК ДокументСнятияСУчетаНУ,
	|
	|	ВЫБОР
	|		КОГДА ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюУУ <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА &Ссылка 
	|		ИНАЧЕ ПервоначальныеСведенияОС.ДокументСнятияСУчетаУУ
	|	КОНЕЦ КАК ДокументСнятияСУчетаУУ
	|ИЗ
	|	втПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПроводкиРегУчета

Функция ТекстОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";
	
	//++ Локализация
	
	СписокЗапросов = Новый Массив;
	
	ВнеоборотныеАктивыЛокализация.ТекстОтраженияВРеглУчетеСписанияОС(СписокЗапросов);
	ВнеоборотныеАктивыЛокализация.ТекстОтраженияВРеглУчетеЗакрытияСчетовПоАренде(СписокЗапросов);

	#Область СписаниеОстаточнойСтоимостиОС // Дт <76.07.1> - Кт <01.09>
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание остаточной стоимости ОС (<76.07.1> - Кт <01.09>)
	|ВЫБРАТЬ
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	СтрокиДт.СуммаРегл КАК Сумма,
	|	СтрокиДт.СуммаУпр КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АрендныеОбязательства) КАК ВидСчетаДт,
	|	СтрокиДт.Договор.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	СтрокиДт.Валюта КАК ВалютаДт,
	|	ВЫРАЗИТЬ(СтрокиДт.Договор КАК Справочник.ДоговорыАренды).Подразделение КАК ПодразделениеДт,
	|	ВЫРАЗИТЬ(СтрокиДт.Договор КАК Справочник.ДоговорыАренды).НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоДт1,
	|	СтрокиДт.Договор    КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО        КАК СубконтоДт3,
	|	
	|	СтрокиДт.Сумма КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаКт,
	|	СтрокиКт.СтатьяРасходов КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	СтрокиКт.СтатьяРасходов КАК СубконтоКт1,
	|	СтрокиКт.АналитикаРасходов КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.СуммаРегл - СтрокиКт.ПостояннаяРазница - СтрокиКт.ВременнаяРазница КАК СуммаНУКт,
	|	СтрокиКт.ПостояннаяРазница КАК СуммаПРКт,
	|	СтрокиКт.ВременнаяРазница КАК СуммаВРКт,
	|	
	|	""Списание остаточной стоимости ОС"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоФинансовымИнструментам КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|			И СтрокиДт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеСтоимостиАрендованныхОС)";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область БалансировкаВР_СписаниеОстаточнойСтоимостиОС // Дт <76.А> - Кт <01.09>
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание остаточной стоимости ОС (<76.А> - Кт <01.09>)
	|ВЫБРАТЬ
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	СтрокиДт.Договор.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	СтрокиДт.Валюта КАК ВалютаДт,
	|	ВЫРАЗИТЬ(СтрокиДт.Договор КАК Справочник.ДоговорыАренды).Подразделение КАК ПодразделениеДт,
	|	ВЫРАЗИТЬ(СтрокиДт.Договор КАК Справочник.ДоговорыАренды).НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БалансировкаВРПоДоговорамАренды) КАК СчетДт,
	|	
	|	СтрокиДт.АналитикаУчетаПоПартнерам.Контрагент КАК СубконтоДт1,
	|	СтрокиДт.Договор    КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО        КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	-СтрокиКт.ВременнаяРазница КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	СтрокиКт.ВременнаяРазница КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаКт,
	|	СтрокиКт.СтатьяРасходов КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	СтрокиКт.СтатьяРасходов КАК СубконтоКт1,
	|	СтрокиКт.АналитикаРасходов КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Списание остаточной стоимости ОС, балансировка ВР"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоФинансовымИнструментам КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|			И СтрокиДт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеСтоимостиАрендованныхОС)";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Прочее

Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация
	
	ТекстЗапросаТаблицаСобытияОСОрганизаций(ТекстыЗапроса, Регистры);

	РеглУчетПроведениеСервер.ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(Запрос, ТекстыЗапроса, Регистры);
	//-- Локализация
	
КонецПроцедуры

Процедура ТаблицыОтложенногоФормированияДвижений(ТекстыЗапроса) Экспорт
	
	//++ Локализация
	ВнеоборотныеАктивыЛокализация.ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(ТекстыЗапроса, Неопределено);
	//-- Локализация
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(Объект, Основание) Экспорт

	//++ Локализация
	
	Если Основание.Свойство("ДокументОснование")
		И ТипЗнч(Основание.ДокументОснование) = Тип("ДокументСсылка.ИнвентаризацияОС") Тогда
		ЗаполнитьНаОснованииИнвентаризацииОСПриВводеНаОсновании(Объект, Основание);
	КонецЕсли; 
	
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

//++ Локализация

#Область Локализация

Процедура ТекстЗапросаТаблицаСобытияОСОрганизаций(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "СобытияОСОрганизаций";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = 
	"ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	&НазваниеДокумента КАК НазваниеДокумента,
	|	&НомерНаПечать КАК НомерДокумента
	|ИЗ
	|	Документ.ПрекращениеДоговораАренды.ОС КАК ТаблицаОС
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(Текст, ИмяРегистра);
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииИнвентаризацииОСПриВводеНаОсновании(Объект, ДанныеЗаполнения)
	
	МассивНомеровСтрок = Неопределено;
	СообщатьОбОшибках = Истина;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Объект.ДокументОснование = ДанныеЗаполнения.ДокументОснование;
		МассивНомеровСтрок = ДанныеЗаполнения.МассивНомеровСтрок;
		СообщатьОбОшибках = ДанныеЗаполнения.СообщатьОбОшибках;
	Иначе
		Объект.ДокументОснование = ДанныеЗаполнения;
	КонецЕсли;
	
	ЗаполнитьНаОснованииИнвентаризацииОС(Объект, СообщатьОбОшибках, МассивНомеровСтрок);
	
КонецПроцедуры

// Заполняет документ на основании инвентаризации ОС
//
// Параметры:
//  Объект				 - ДокументОбъект.ПрекращениеДоговораАренды	 - Документ, который надо заполнить.
//  СообщатьОбОшибках	 - Булево						 - Истина, если нужно сообщить об ошибках.
//  МассивНомеровСтрок	 - Массив						 - Строки инвентаризации.
//
Процедура ЗаполнитьНаОснованииИнвентаризацииОС(Объект, СообщатьОбОшибках, МассивНомеровСтрок = Неопределено)

	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = Документы.ИнвентаризацияОС.ДанныеЗаполненияНаОснованииИнвентаризации24(
							Объект.ДокументОснование,
							Объект.Дата, 
							"ПрекращениеДоговораАренды", 
							МассивНомеровСтрок);
							
	УдалосьЗаполнить = Ложь;
	
	Если РезультатЗапроса.ТабличнаяЧасть <> Неопределено 
		И НЕ РезультатЗапроса.ТабличнаяЧасть.Пустой() Тогда
	
		СписокОС = РезультатЗапроса.ТабличнаяЧасть.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АрендованныеОС.Договор
		|ИЗ
		|	РегистрСведений.АрендованныеОС.СрезПоследних(&Дата, ОсновноеСредство В (&СписокОС)) КАК АрендованныеОС
		|ГДЕ
		|	АрендованныеОС.Состояние В (
		|		ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ЗаключенДоговорАренды),
		|		ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВАренде))";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("СписокОС", СписокОС);
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
		
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Объект.Договор = Выборка.Договор;
			
			Документы.ПрекращениеДоговораАренды.ЗаполнитьНаОснованииДоговораАренды(Объект);
			УдалосьЗаполнить = (Объект.ОС.Количество() <> 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ УдалосьЗаполнить И СообщатьОбОшибках Тогда
		ТекстОшибки = НСтр("ru = 'В документе %1 отсутствуют арендованные ОС, для которых требуется прекратить договор аренды'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Объект.ДокументОснование);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Объект.ДокументОснование");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//-- Локализация

#КонецОбласти
